conf/src/Documents/ЭП_РеализацияОтгуловДок/ЭП_РеализацияОтгуловДок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_РеализацияОтгуловДок</name>
  <registerRecords>AccumulationRegister.ЭП_УчетОтгулов</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПроведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ЭП_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехническийПроект</name>
      <type>
        <types>CatalogRef.ТехническиеПроекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгула</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/Catalogs/ЭП_Сотрудники/ЭП_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ЭП_ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стажёр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наставник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ЭП_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСотрудника</name>
    <type>
      <types>EnumRef.ЭП_СтатусыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ЭП_ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ЭП_ДолжностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлРезюме</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОД_ЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПрофиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыИзЗУП</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВИПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботникВОфисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКодРевью</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрейдСотрудника</name>
    <type>
      <types>CatalogRef.ЭП_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбменеСЗУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчавствуетВПолученииОкладов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Достижения</name>
    <attributes>
      <name>ВидДостижения</name>
      <type>
        <types>CatalogRef.ЭП_ВидыДостиженийСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеПрофили</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Documents/ЭП_РеализацияОтгуловДок/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭП_РеализацияОтгуловДокСотрудники.ДатаОтгула КАК ДатаОтгула
		|ПОМЕСТИТЬ ВТ_ДатыОтгула
		|ИЗ
		|	Документ.ЭП_РеализацияОтгуловДок.Сотрудники КАК ЭП_РеализацияОтгуловДокСотрудники
		|ГДЕ
		|	ЭП_РеализацияОтгуловДокСотрудники.Ссылка.Проведен
		|	И ЭП_РеализацияОтгуловДокСотрудники.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.Период КАК Период,
		|	ВТ_ДатыОтгула.ДатаОтгула КАК ДатаОтгула
		|ИЗ
		|	ВТ_ДатыОтгула КАК ВТ_ДатыОтгула
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ДатыЗакрытияРедактированияПоказателей.СрезПоследних КАК ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних
		|		ПО (ВТ_ДатыОтгула.ДатаОтгула <= КОНЕЦПЕРИОДА(ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.Период, МЕСЯЦ))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.Период УБЫВ"; 
		
		Запрос.УстановитьПараметр("Ссылка",Параметры.Ключ);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСотрудники

&НаКлиенте
Процедура СотрудникиДатаОтгулаПриИзменении(Элемент)
	
	ИндексСтроки = Элементы.Сотрудники.ТекущаяСтрока;
	СтрокаТЧ = Объект.Сотрудники.НайтиПоИдентификатору(ИндексСтроки);
    ДеньНеделиДляПроверки = ДеньНедели(СтрокаТЧ.ДатаОтгула);
	
	Если ДеньНеделиДляПроверки = 6 ИЛИ ДеньНеделиДляПроверки = 7 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нелья добавить отгул на выходной день");
		СтрокаТЧ.ДатаОтгула = Дата(1,1,1);
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда
		
		 СотрудникиСотрудникПриИзмененииНаСервере(СтрокаТЧ.ДатаОтгула, СтрокаТЧ.Сотрудник, ИндексСтроки)
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиСотрудникПриИзмененииНаСервере(ДатаОтгула, Сотрудник, ИндексСтроки)

	СтруктураДаты = Новый Структура(); 
	СтруктураДаты.Вставить("ДатаОтгула", ДатаОтгула); 
	СтруктураДаты.Вставить("Сотрудник", Сотрудник);
	
	Если Объект.Сотрудники.Количество() > 1 И ЗначениеЗаполнено(ДатаОтгула) Тогда

	НайденныеДаты = Объект.Сотрудники.НайтиСтроки(СтруктураДаты);
	
		Если НайденныеДаты.Количество() > 1 Тогда
			
			ОбщегоНазначения.СообщитьПользователю("По сотруднику " + Сотрудник + " на дату "
			+ Формат(ДатаОтгула, "ДЛФ=D") + " уже есть запись в строке " + НайденныеДаты[0].НомерСтроки);			
			Объект.Сотрудники.Удалить(ИндексСтроки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент) 
	
	ИндексСтроки = Элементы.Сотрудники.ТекущаяСтрока;
	СтрокаТЧ = Объект.Сотрудники.НайтиПоИдентификатору(ИндексСтроки);
	
	Если Объект.Сотрудники.Количество() > 1 Тогда
		СотрудникиСотрудникПриИзмененииНаСервере(СтрокаТЧ.ДатаОтгула, СтрокаТЧ.Сотрудник, ИндексСтроки); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если НЕ Объект.Проект.Пустая() И ЗначениеЗаполнено(Элементы.Сотрудники.ТекущиеДанные.Департамент) И ЗначениеЗаполнено(Объект.Проект) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;                                                   
		ПараметрыФормы.Вставить("Проект",Объект.Проект);
		ПараметрыФормы.Вставить("Департамент", Элементы.Сотрудники.ТекущиеДанные.Департамент);
		ОткрытьФорму("Справочник.ЭП_Сотрудники.Форма.ФормаВыбораПереработки", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 	
	Иначе
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(,"Не заполнен проект или поле табличной части департамент, работа подбора не возможна",,"Предупреждение"); 
		Возврат; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.ЭП_Сотрудники.Форма.ФормаВыбораПереработки" Тогда
		ДобавитьЗапись(ВыбранноеЗначение.Сотрудник, Элементы.Сотрудники.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗапись(Выбор, ИндексСтроки)
	
	Если ТипЗнч(Выбор) = Тип("СправочникСсылка.ЭП_Сотрудники") Тогда 
		СтрокаТЧ = Объект.Сотрудники.НайтиПоИдентификатору(ИндексСтроки);
		СтрокаТЧ.Сотрудник = Выбор;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_РеализацияОтгуловСотрудники.Сотрудник КАК Сотрудник,
		|	ЭП_РеализацияОтгуловСотрудники.ДатаОтгула КАК ДатаОтгула,
		|	ЭП_РеализацияОтгуловСотрудники.Сотрудник.Представление КАК СотрудникПредставление
		|ИЗ
		|	Документ.ЭП_РеализацияОтгуловДок.Сотрудники КАК ЭП_РеализацияОтгуловСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭП_РеализацияОтгуловДок КАК ЭП_РеализацияОтгулов
		|		ПО ЭП_РеализацияОтгуловСотрудники.Ссылка = ЭП_РеализацияОтгулов.Ссылка
		|ГДЕ
		|	ЭП_РеализацияОтгуловСотрудники.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();   
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого СтрокаТЧ Из Объект.Сотрудники Цикл
			
			Если СтрокаТЧ.ДатаОтгула = Выборка.ДатаОтгула И СтрокаТЧ.Сотрудник = Выборка.Сотрудник Тогда
				
				Отказ = Истина;
				СтрокаСообщения = СтрШаблон("По сотруднику %1 на дату %2 уже зарегистрирован отгул", Выборка.СотрудникПредставление, Выборка.ДатаОтгула);
				ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);  
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти
